app/models/user.rb

  def validate_username
    errors.add(:username, :invalid) if User.where(email: username).exists?
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ztcollazo"], ["LIMIT", 1]]

  def self.find_for_database_authentication(warden_conditions)
    conditions = warden_conditions.dup
    if (login = conditions.delete(:login))
      where(conditions.to_h).where(['lower(username) = :value OR lower(email) = :value',
                                    { value: login.downcase }]).first
---
SELECT "users".* FROM "users" WHERE (lower(username) = 'ztcollazo' OR lower(email) = 'ztcollazo') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]